app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "body" = ?, "published" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", ""], ["body", "content changed"], ["published", 1], ["updated_at", "2023-05-09 01:06:08.915245"], ["id", 20]]